particle-iot/device-os/hal/src/nRF52840/exflash_hal.c
        // This may block for up to 1ms (QSPI_DEF_WAIT_TIME_US * QSPI_DEF_WAIT_ATTEMPTS)
        err = nrfx_qspi_mem_busy_check();

#if MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
        // Exit critical section
        os_thread_scheduling(true, NULL);
#endif // MODULE_FUNCTION != MOD_FUNC_BOOTLOADER

    } while (err == NRFX_ERROR_BUSY);

    return nrf_system_error(err);
}

static int exflash_qspi_cinstr_xfer(nrf_qspi_cinstr_conf_t const* p_config, void const* p_tx_buffer, void* p_rx_buffer) {
    // Certain operations like block erasure, may leave the flash
    // in a weird state where we can't talk to it for substantial periods of time
    // (up to ~30ms, seen in practice). According to the datasheet, the erasure for example may take up to 200ms!
    // Ensure we have initialized comms with the external flash properly by running TASK_ACTIVATE
    // before applying workaround to decrease the time we are staying with RTOS scheduling disabled.
    exflash_qspi_activate();

#if MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
    // Enter critical section
    os_thread_scheduling(false, NULL);

    // Run QSPI TASK_ACTIVATE task as a workaround for the anomaly 215
    exflash_qspi_activate();
#endif // MODULE_FUNCTION != MOD_FUNC_BOOTLOADER

    // This may block for up to 1ms (QSPI_DEF_WAIT_TIME_US * QSPI_DEF_WAIT_ATTEMPTS)
    nrfx_err_t err = nrfx_qspi_cinstr_xfer(p_config, p_tx_buffer, p_rx_buffer);

#if MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
    // Exit critical section
    os_thread_scheduling(true, NULL);
#endif // MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
    return nrf_system_error(err);
}

static int exflash_qspi_cinstr_quick_send(uint8_t opcode, nrf_qspi_cinstr_len_t length, void const* p_tx_buffer) {
    nrf_qspi_cinstr_conf_t config = NRFX_QSPI_DEFAULT_CINSTR(opcode, length);
    return exflash_qspi_cinstr_xfer(&config, p_tx_buffer, NULL);
}

static int perform_write(uintptr_t addr, const uint8_t* data, size_t size) {
    return nrf_system_error(nrfx_qspi_write(data, size, addr));
}

static int enter_secure_otp() {
    return exflash_qspi_cinstr_quick_send(QSPI_MX25_CMD_ENSO, 1, NULL);
}

static int exit_secure_otp() {
    return exflash_qspi_cinstr_quick_send(QSPI_MX25_CMD_EXSO, 1, NULL);
}

static int exflash_init_MX25R6435FZNIL0() {
    nrf_qspi_cinstr_conf_t cinstr_cfg = PRTCL_QSPI_DEFAULT_CINSTR(QSPI_STD_CMD_WRSR, NRF_QSPI_CINSTR_LEN_4B);
    // Status register, configuration register 1, configuration register 2 values
    uint8_t config_values[3] = { 0x40, 0x00, 0x02 };
    return exflash_qspi_cinstr_xfer(&cinstr_cfg, config_values, NULL);
}

static int exflash_init_MX25L3233F() {
    nrf_qspi_cinstr_conf_t cinstr_cfg = PRTCL_QSPI_DEFAULT_CINSTR(QSPI_STD_CMD_WRSR, NRF_QSPI_CINSTR_LEN_2B);
    uint8_t status_register[1] = { 0x40 };
    return exflash_qspi_cinstr_xfer(&cinstr_cfg, status_register, NULL);
}

static int exflash_init_GD25() {
    nrf_qspi_cinstr_conf_t cinstr_cfg = PRTCL_QSPI_DEFAULT_CINSTR(QSPI_STD_CMD_WRSR, NRF_QSPI_CINSTR_LEN_2B);
    uint8_t status_registers[3] = {0x00, 0x02, 0x00};

    CHECK_FALSE(exflash_qspi_cinstr_xfer(&cinstr_cfg, &status_registers[0], NULL), SYSTEM_ERROR_FLASH_IO);
    
    cinstr_cfg.opcode = QSPI_GD25_CMD_WRSR2;
    CHECK_FALSE(exflash_qspi_cinstr_xfer(&cinstr_cfg, &status_registers[1], NULL), SYSTEM_ERROR_FLASH_IO);

    cinstr_cfg.opcode = QSPI_GD25_CMD_WRSR3;
    CHECK_FALSE(exflash_qspi_cinstr_xfer(&cinstr_cfg, &status_registers[2], NULL), SYSTEM_ERROR_FLASH_IO);

    return 0;
}

int gd25_secure_register_read(uint8_t security_registers_index, uint32_t security_registers_addr, void* buf, size_t size) {
    CHECK_TRUE(security_registers_index < GD25_SECURITY_REGISTER_COUNT, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(security_registers_addr + size <= GD25_SECURITY_REGISTER_SIZE, SYSTEM_ERROR_INVALID_ARGUMENT);

    nrf_qspi_cinstr_conf_t readSecurityRegister = PRTCL_QSPI_DEFAULT_CINSTR(QSPI_GD25_CMD_SEC_READ, NRF_QSPI_CINSTR_LEN_1B);

    // 3 bytes of address data + 1 byte of dummy data
    uint8_t addrBuf[4] = {}; 
    uint32_t address = ((security_registers_index + 1) << 12) + security_registers_addr;
    addrBuf[0] = (uint8_t)((address>>16) & 0xFF);
    addrBuf[1] = (uint8_t)((address>>8) & 0xFF);
    addrBuf[2] = (uint8_t)((address>>0) & 0xFF);
    addrBuf[3] = 0x00;

    // TODO: Should this be called via exflash_qspi_cinstr_xfer() with thread scheduling suspension etc?
    // TODO: Validate return codes, return result
    // start long frame transfer with "Read Security Register" opcode
    nrfx_qspi_lfm_start(&readSecurityRegister);
    // Send address + dummy bytes, do not finalize long frame transfer
    nrfx_qspi_lfm_xfer(addrBuf, NULL, sizeof(addrBuf), false);
    // Read security register data, finalize long frame transfer
    nrfx_qspi_lfm_xfer(NULL, buf, size, true);

    return 0;
}

int gd25_secure_register_write(uint8_t security_registers_index, uint32_t security_registers_addr, const void* buf, size_t size) {
    CHECK_TRUE(security_registers_index < GD25_SECURITY_REGISTER_COUNT, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(security_registers_addr + size <= GD25_SECURITY_REGISTER_SIZE, SYSTEM_ERROR_INVALID_ARGUMENT);

    nrf_qspi_cinstr_conf_t writeSecurityRegister = PRTCL_QSPI_DEFAULT_CINSTR(QSPI_GD25_CMD_SEC_PROGRAM, NRF_QSPI_CINSTR_LEN_1B);

    uint32_t address = 0;
    uint8_t addrBuf[3] = {};
    address = ((security_registers_index + 1) << 12) + security_registers_addr;
    addrBuf[0] = (uint8_t)((address>>16) & 0xFF);
    addrBuf[1] = (uint8_t)((address>>8) & 0xFF);
    addrBuf[2] = (uint8_t)((address>>0) & 0xFF);

    nrfx_qspi_lfm_start(&writeSecurityRegister);
    nrfx_qspi_lfm_xfer(addrBuf, NULL, sizeof(addrBuf), false); // Send address bytes, do not finalize long frame transfer
    nrfx_qspi_lfm_xfer(buf, NULL, size, true); // Send data to write, finalize long frame transfer

    return 0;
}

static void exflash_set_driver_parameters(uint32_t flash_type) {
    switch (flash_type) {
        case QSPI_TYPE_MX25L3233F: // fall through
        case QSPI_TYPE_MX25R6435FZNIL0:
            hal_exflash_driver.type = flash_type;
            hal_exflash_driver.write_opcode = (nrf_qspi_writeoc_t)NRFX_QSPI_CONFIG_WRITEOC; // 0x38: PP4IO
            hal_exflash_driver.pgmers_suspend_opcode = QSPI_MX25_CMD_PGMERS_SUSPEND;
            hal_exflash_driver.sck_delay = (uint8_t)NRFX_QSPI_CONFIG_SCK_DELAY;
            hal_exflash_driver.otp_size = (flash_type == QSPI_TYPE_MX25R6435FZNIL0) ? MX25R6435F_OTP_SECTOR_SIZE : MX25L3233F_OTP_SECTOR_SIZE;
            hal_exflash_driver.init = (flash_type == QSPI_TYPE_MX25R6435FZNIL0) ? &exflash_init_MX25R6435FZNIL0 : &exflash_init_MX25L3233F;
            break;
        case QSPI_TYPE_GD25WQ64EQFG:
            hal_exflash_driver.type = QSPI_TYPE_GD25WQ64EQFG;
            hal_exflash_driver.write_opcode = NRF_QSPI_WRITEOC_PP4O; // 0x32: PP40
            hal_exflash_driver.pgmers_suspend_opcode = QSPI_GD25_CMD_PGMERS_SUSPEND;
            hal_exflash_driver.sck_delay = 2;
            hal_exflash_driver.otp_size = GD25_OTP_SECTOR_SIZE;
            hal_exflash_driver.init = &exflash_init_GD25;
            break;
        case QSPI_TYPE_END: // fall through
        default:
            break;
    }
}

//__attribute__(( optimize("-O0") ))
int hal_exflash_init(void) {
    int ret = 0;

    // PATCH: Initialize CS pin, external memory discharge
    nrf_gpio_cfg_output(QSPI_FLASH_CSN_PIN);
    nrf_gpio_pin_set(QSPI_FLASH_CSN_PIN);
    nrf_gpio_cfg_input(QSPI_FLASH_IO1_PIN, NRF_GPIO_PIN_PULLDOWN);

