particle-iot/device-os/hal/src/nRF52840/exflash_hal.c
    hal_exflash_lock();

    for (uint32_t i = 0; i < QSPI_TYPE_END && !hal_exflash_driver.part_detected; i++) {
        exflash_set_driver_parameters(i);

        nrfx_qspi_config_t config = {
            .xip_offset  = NRFX_QSPI_CONFIG_XIP_OFFSET,
            .pins = {
               .sck_pin     = QSPI_FLASH_SCK_PIN,
               .csn_pin     = QSPI_FLASH_CSN_PIN,
               .io0_pin     = QSPI_FLASH_IO0_PIN,
               .io1_pin     = QSPI_FLASH_IO1_PIN,
               .io2_pin     = QSPI_FLASH_IO2_PIN,
               .io3_pin     = QSPI_FLASH_IO3_PIN,
            },
            .irq_priority   = (uint8_t)QSPI_FLASH_IRQ_PRIORITY,
            .prot_if = {
                .readoc     = (nrf_qspi_readoc_t)NRFX_QSPI_CONFIG_READOC,
                .writeoc    = hal_exflash_driver.write_opcode,
                .addrmode   = (nrf_qspi_addrmode_t)NRFX_QSPI_CONFIG_ADDRMODE,
                .dpmconfig  = false,
            },
            .phy_if = {
                .sck_freq   = (nrf_qspi_frequency_t)NRFX_QSPI_CONFIG_FREQUENCY,
                .sck_delay  = hal_exflash_driver.sck_delay,
                .spi_mode   = (nrf_qspi_spi_mode_t)NRFX_QSPI_CONFIG_MODE,
                .dpmen      = false
            },
        };

        ret = nrfx_qspi_init(&config, NULL, NULL);
        if (ret) {
            if (ret == NRFX_ERROR_TIMEOUT) {
                // Could have timed out because the flash chip might be in an ongoing program/erase operation.
                // Suspend it.
                LOG_DEBUG(TRACE, "QSPI NRFX timeout error. Suspend pgm/ers op.");
                ret = hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_SUSPEND_PGMERS, NULL, NULL, 0);
                if (ret) {
                    ret = nrf_system_error(ret);
                    continue;
                }
            }
        }
        LOG_DEBUG(TRACE, "QSPI initialized.");
        qspi_state = HAL_EXFLASH_STATE_ENABLED;

        // Determine chip type / wake up from potential sleep
        uint8_t chip_id[3] = {};
        ret = hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_READID, NULL, chip_id, 0);

        if (ret) {
            continue;
        }
        else {
            LOG_DEBUG(TRACE, "exflash chip id: %02X %02X %02X", chip_id[0], chip_id[1], chip_id[2]);
        }

        if ((hal_exflash_driver.type == QSPI_TYPE_MX25R6435FZNIL0 || hal_exflash_driver.type == QSPI_TYPE_MX25L3233F) && 
            chip_id[0] == MX25_MANUFACTURER_ID) {
            if (chip_id[1] == MX25R6435F_MEMORY_TYPE) {
                exflash_set_driver_parameters(QSPI_TYPE_MX25R6435FZNIL0);
            } else if (chip_id[1] == MX25L3233F_MEMORY_TYPE) {
                exflash_set_driver_parameters(QSPI_TYPE_MX25L3233F);
            } else {
                // Unrecognized MXIC part, return error
                ret = SYSTEM_ERROR_NOT_SUPPORTED;
                break;
            }
            hal_exflash_driver.part_detected = true;
        } else if ((hal_exflash_driver.type == QSPI_TYPE_GD25WQ64EQFG) && (chip_id[0] == GD25_MANUFACTURER_ID)) {
            hal_exflash_driver.part_detected = true;
        }

        if (hal_exflash_driver.part_detected) {
            // Reset chip, put it into QSPI mode
            ret = hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_RESET, NULL, NULL, 0);    
        }        
    }

    hal_exflash_unlock();
    return ret;
}

int hal_exflash_uninit(void) {
    hal_exflash_lock();

    nrfx_qspi_uninit();
    // PATCH: Initialize CS pin, external memory discharge
    nrf_gpio_cfg_output(QSPI_FLASH_CSN_PIN);
    nrf_gpio_pin_set(QSPI_FLASH_CSN_PIN);
    nrf_gpio_cfg_input(QSPI_FLASH_IO1_PIN, NRF_GPIO_PIN_PULLDOWN);
    // The nrfx_qspi driver doesn't clear pending IRQ
    sd_nvic_ClearPendingIRQ(QSPI_IRQn);

    qspi_state = HAL_EXFLASH_STATE_DISABLED;

    hal_exflash_unlock();

    return SYSTEM_ERROR_NONE;
}

int hal_exflash_write(uintptr_t addr, const uint8_t* data_buf, size_t data_size) {
    hal_exflash_lock();
    int ret = hal_flash_common_write(addr, data_buf, data_size,
                                     &perform_write, &hal_flash_common_dummy_read);
    exflash_qspi_wait_completion();
    hal_exflash_unlock();
    return ret;
}

int hal_exflash_read(uintptr_t addr, uint8_t* data_buf, size_t data_size) {
    int ret = 0;
    hal_exflash_lock();
    {
        const uintptr_t src_aligned = ADDR_ALIGN_WORD(addr);
        uint8_t* dst_aligned = (uint8_t*)ADDR_ALIGN_WORD_RIGHT((uintptr_t)data_buf);
        const size_t unaligned_bytes = MIN(data_size, (size_t)(dst_aligned - data_buf));
        const size_t size_aligned = ADDR_ALIGN_WORD(data_size - unaligned_bytes);

        if (size_aligned > 0) {
            /* Read-out the aligned portion into an aligned address in the buffer
             * with an adjusted size in multiples of 4.
             */
            ret = nrfx_qspi_read(dst_aligned, size_aligned, src_aligned);

            if (ret != NRF_SUCCESS) {
                goto hal_exflash_read_done;
            }

            /* Move the data if necessary */
            if (dst_aligned != data_buf || src_aligned != addr) {
                const unsigned offset_front = addr - src_aligned;
                const size_t bytes_read = size_aligned - offset_front;

                memmove(data_buf, dst_aligned + offset_front, bytes_read);

                /* Adjust addresses and size */
                addr += bytes_read;
                data_buf += bytes_read;
                data_size -= bytes_read;
            } else {
                /* Adjust addresses and size */
                addr += size_aligned;
                data_buf += size_aligned;
                data_size -= size_aligned;
            }
        }
    }

    /* Read the remaining unaligned portion into a temporary buffer and copy into
     * the destination buffer
     */
    if (data_size > 0) {
        uint8_t tmpbuf[sizeof(uint32_t) * 2] __attribute__((aligned(4)));

        /* Read the remainder */
        const uintptr_t src_aligned = ADDR_ALIGN_WORD(addr);
        const size_t size_aligned = ADDR_ALIGN_WORD_RIGHT((addr + data_size) - src_aligned);

