particle-iot/device-os/hal/src/nRF52840/exflash_hal.c
        ret = nrfx_qspi_read(tmpbuf, size_aligned, src_aligned);

        if (ret != NRF_SUCCESS) {
            goto hal_exflash_read_done;
        }

        const unsigned offset_front = addr - src_aligned;

        memcpy(data_buf, tmpbuf + offset_front, data_size);
    }

hal_exflash_read_done:
    hal_exflash_unlock();
    return nrf_system_error(ret);
}

static int erase_common(uintptr_t start_addr, size_t num_blocks, nrf_qspi_erase_len_t len) {
    hal_exflash_lock();
    int err_code = NRF_SUCCESS;

    const size_t block_length = len == NRF_QSPI_ERASE_LEN_4KB ? 4096 : 64 * 1024;

    /* Round down to the nearest block */
    start_addr = ((start_addr / block_length) * block_length);

    for (size_t i = 0; i < num_blocks; i++) {
        err_code = nrfx_qspi_erase(len, start_addr);
        if (err_code) {
            goto erase_common_done;
        }

        exflash_qspi_wait_completion();

        start_addr += block_length;
    }

    // LOG_DEBUG(TRACE, "Erased %lu %lukB blocks starting from %" PRIxPTR,
    //           num_blocks, block_length / 1024, start_addr);

erase_common_done:
    hal_exflash_unlock();
    return nrf_system_error(err_code);
}

int hal_exflash_erase_sector(uintptr_t start_addr, size_t num_sectors) {
    return erase_common(start_addr, num_sectors, NRF_QSPI_ERASE_LEN_4KB);
}

int hal_exflash_erase_block(uintptr_t start_addr, size_t num_blocks) {
    return erase_common(start_addr, num_blocks, NRF_QSPI_ERASE_LEN_64KB);
}

int hal_exflash_copy_sector(uintptr_t src_addr, uintptr_t dest_addr, size_t data_size) {
    hal_exflash_lock();
    int ret = -1;
    if ((src_addr % sFLASH_PAGESIZE) ||
        (dest_addr % sFLASH_PAGESIZE) ||
        !(IS_WORD_ALIGNED(data_size))) {
        goto hal_exflash_copy_sector_done;
    }

    // erase sectors
    uint16_t sector_num = CEIL_DIV(data_size, sFLASH_PAGESIZE);
    if (hal_exflash_erase_sector(dest_addr, sector_num)) {
        goto hal_exflash_copy_sector_done;
    }

    // memory copy
    uint8_t data_buf[FLASH_OPERATION_TEMP_BLOCK_SIZE] __attribute__((aligned(4)));
    unsigned index = 0;
    uint16_t copy_len;

    for (index = 0; index < data_size; index += copy_len) {
        copy_len = MIN((data_size - index), sizeof(data_buf));
        if (hal_exflash_read(src_addr + index, data_buf, copy_len)) {
            goto hal_exflash_copy_sector_done;
        }
        if (hal_exflash_write(dest_addr + index, data_buf, copy_len)) {
            goto hal_exflash_copy_sector_done;
        }
    }

    ret = 0;

hal_exflash_copy_sector_done:
    hal_exflash_unlock();
    return ret;
}

int hal_exflash_read_special(hal_exflash_special_sector_t sp, uintptr_t addr, uint8_t* data_buf, size_t data_size) {
    CHECK_TRUE(sp == HAL_EXFLASH_SPECIAL_SECTOR_OTP, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(addr + data_size <= hal_exflash_driver.otp_size, SYSTEM_ERROR_OUT_OF_RANGE);
    CHECK_TRUE(data_buf != NULL, SYSTEM_ERROR_INVALID_ARGUMENT);
    int ret = 0;

    hal_exflash_lock();

    if (hal_exflash_driver.type == QSPI_TYPE_GD25WQ64EQFG) {
        // Determine which OTP Register to start writing to
        size_t otp_page = addr / GD25_OTP_SECTOR_SIZE;
        size_t data_to_read = data_size;
        size_t data_read = 0;
        size_t read_amount = 0;

        while (data_to_read && !ret) {
            // Determine the offset of the current OTP register to start writing at
            size_t register_offset = (addr + data_read) % GD25_SECURITY_REGISTER_SIZE;
            read_amount = data_to_read;

            // If the data remaining to read extends into the next register, truncate the read amount to fit into this register
            if (register_offset + read_amount > GD25_SECURITY_REGISTER_SIZE){
                read_amount = GD25_SECURITY_REGISTER_SIZE - register_offset;
            }

            ret = gd25_secure_register_read(otp_page, register_offset, &data_buf[data_read], read_amount);

            // Increment/decrement counter variables, increment to the next OTP register
            data_to_read -= read_amount;
            data_read += read_amount;
            otp_page++;
        }
    } else {
        ret = enter_secure_otp();
        if (!ret) {
            ret = hal_exflash_read(addr, data_buf, data_size);
        }
        exit_secure_otp(); 
    }

    hal_exflash_unlock();
    return ret;
}

int hal_exflash_write_special(hal_exflash_special_sector_t sp, uintptr_t addr, const uint8_t* data_buf, size_t data_size) {
    CHECK_TRUE(sp == HAL_EXFLASH_SPECIAL_SECTOR_OTP, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(addr + data_size <= hal_exflash_driver.otp_size, SYSTEM_ERROR_OUT_OF_RANGE);
    CHECK_TRUE(data_buf != NULL, SYSTEM_ERROR_INVALID_ARGUMENT);
    int ret = 0;

    hal_exflash_lock();

    if (hal_exflash_driver.type == QSPI_TYPE_GD25WQ64EQFG) {
        // Determine which OTP Register to start writing to
        size_t otp_page = addr / GD25_OTP_SECTOR_SIZE;
        size_t data_to_write = data_size;
        size_t data_written = 0;
        size_t write_amount = 0;

        while (data_to_write && !ret) {
            // Determine the offset of the current OTP register to start writing at
            size_t register_offset = (addr + data_written) % GD25_SECURITY_REGISTER_SIZE;
            write_amount = data_to_write;

            // If the data remaining to write extends into the next register, truncate the write amount to fit into this register
            if (register_offset + write_amount > GD25_SECURITY_REGISTER_SIZE){
                write_amount = GD25_SECURITY_REGISTER_SIZE - register_offset;
            }

            ret = gd25_secure_register_write(otp_page, register_offset, &data_buf[data_written], write_amount);

            // Increment/decrement counter variables, increment to the next OTP register
            data_to_write -= write_amount;
            data_written += write_amount;
            otp_page++;
        }
    } else {
        ret = enter_secure_otp();
        if (!ret) {
            ret = hal_exflash_write(addr, data_buf, data_size);
        }
        exit_secure_otp();
    }

    hal_exflash_unlock();
    return ret;
}

int hal_exflash_erase_special(hal_exflash_special_sector_t sp, uintptr_t addr, size_t size) {
    /* We only support OTP sector and since it's One Time Programmable, we can't erase it */
    // TODO: GD25 *can* support OTP erasing, do we want to implement it? 
    return -1;
}

int hal_exflash_special_command(hal_exflash_special_sector_t sp, hal_exflash_command_t cmd, const uint8_t* data, uint8_t* result, size_t size) {
    int ret = -1;

