particle-iot/device-os/hal/src/nRF52840/exflash_hal.c
    hal_exflash_lock();
    /* General commands */
    if (sp == HAL_EXFLASH_SPECIAL_SECTOR_NONE) {
        nrf_qspi_cinstr_conf_t cinstr_cfg = {
            .length    = NRF_QSPI_CINSTR_LEN_1B,
            .io2_level = true,
            .io3_level = true,
            .wipwait   = true,
            .wren      = true
        };

        if (cmd == HAL_EXFLASH_COMMAND_SLEEP) {
            cinstr_cfg.opcode = QSPI_STD_CMD_SLEEP;
        } else if (cmd == HAL_EXFLASH_COMMAND_WAKEUP || cmd == HAL_EXFLASH_COMMAND_READID) {
            /* Wake up external flash from deep power down mode by sending read id command */
            cinstr_cfg.opcode = QSPI_STD_CMD_READ_ID;
            cinstr_cfg.length = NRF_QSPI_CINSTR_LEN_4B;
        } else if (cmd == HAL_EXFLASH_COMMAND_SUSPEND_PGMERS) {
            /* suspend an ongoing program or erase operation */
            cinstr_cfg.opcode = hal_exflash_driver.pgmers_suspend_opcode;
        } else if (cmd == HAL_EXFLASH_COMMAND_RESET) {
            cinstr_cfg.opcode = QSPI_STD_CMD_RSTEN;
        } else {
            goto exit;
        }

        // Execute the command.
        ret = exflash_qspi_cinstr_xfer(&cinstr_cfg, NULL, result);

        // For the reset procedure, we need to execute the reset command going forward.
        if (!ret && cmd == HAL_EXFLASH_COMMAND_RESET) {
            cinstr_cfg.opcode = QSPI_STD_CMD_RST;
            ret = exflash_qspi_cinstr_xfer(&cinstr_cfg, NULL, NULL);
            if (ret) {
                goto exit;
            }

            if (hal_exflash_driver.init) {
                // TODO: Consolidate init here?
                ret = hal_exflash_driver.init();
            }
        }
    } else if (sp == HAL_EXFLASH_SPECIAL_SECTOR_OTP) {
        /* OTP-specific commands */
        if (cmd == HAL_EXFLASH_COMMAND_LOCK_ENTIRE_OTP) {
            /* Secured OTP Indicator bit (4K-bit Secured OTP)
             * 1 = factory lock
             * This will block the whole OTP region.
             */
            uint8_t v = 0x01;
            ret = exflash_qspi_cinstr_quick_send(QSPI_MX25_CMD_WRSCUR, 2, &v);
            // TODO: Lock OTP for GD25?
        }
    }

exit:
    hal_exflash_unlock();
    return ret;
}

int hal_exflash_sleep(bool sleep, void* reserved) {
    hal_exflash_lock();
    if (sleep) {
        // Suspend external flash
        if (qspi_state != HAL_EXFLASH_STATE_ENABLED) {
            hal_exflash_unlock();
            return SYSTEM_ERROR_INVALID_STATE;
        }
        // Put external flash into Deep Power-down mode
        if (hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_SLEEP, NULL, NULL, 0)) {
            // It may fail as the flash chip might be in an ongoing program/erase operation. Suspend it.
            hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_SUSPEND_PGMERS, NULL, NULL, 0);
            // Abort the suspended write/erase operation.
            hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_RESET, NULL, NULL, 0);
            // Try enter Deep Power-down mode again
            int ret = hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_SLEEP, NULL, NULL, 0);
            if (ret) {
                // Give up entering Deep Power-down mode.
                hal_exflash_unlock();
                return ret;
            }
        }
        // Disable QSPI peripheral
        hal_exflash_uninit();
        qspi_state = HAL_EXFLASH_STATE_SUSPENDED;
    } else {
        // Restore external flash
        if (qspi_state != HAL_EXFLASH_STATE_SUSPENDED) {
            hal_exflash_unlock();
            return SYSTEM_ERROR_INVALID_STATE;
        }
        int ret = hal_exflash_init();
        if (ret != SYSTEM_ERROR_NONE) {
            hal_exflash_unlock();
            return ret;
        }
    }
    hal_exflash_unlock();
    return SYSTEM_ERROR_NONE;
}

int hal_exflash_otp_size(void) {
    return hal_exflash_driver.part_detected ? (int)hal_exflash_driver.otp_size : SYSTEM_ERROR_UNKNOWN;
}
